# -----Импорт пакетов-------------------------------------------------------------


# -----Подключение----------------------------------------------------------------

# установить соединение с MongoClient

# создать БД

# создать коллекцию


# ------Добавление------------------------------------------------------------------------------------------------------

# добавить несколько документов в коллекцию


# ------Запросы---------------------------------------------------------------------------------------------------------

# получить имена коллекций из БД

# получить один любой документ из коллекции

# получить все документы из коллекции + сортировка по одному из полей

# получить все документы из коллекции удовлетворяющие условию

# получить количество документов в коллекции удовлетворяющих условию


# ------Обновление------------------------------------------------------------------------------------------------------

# обновить все документы удовлетворяющие условию и получить количество обновленных


# ------Удаление--------------------------------------------------------------------------------------------------------

# попытаться удалить все документы удовлетворяющие условию и получить количество удаленных

